# Lab SQL 9
In this lab we will find the customers who were active in consecutive months of May and June. Follow the steps to complete the analysis.

## Create a table `rentals_may` to store the data from rental table with information for the month of May.

In [28]:
may_table = '''
CREATE TABLE may_table(
rental_id INT UNIQUE NOT NULL, 
rental_date DATETIME DEFAULT NULL,
inventory_id INT UNSIGNED DEFAULT NULL,
customer_id INT UNSIGNED DEFAULT NULL,
return_date DATETIME DEFAULT NULL,
staff_id INT UNSIGNED DEFAULT NULL,
last_update TIMESTAMP DEFAULT NULL,
CONSTRAINT PRIMARY KEY (rental_id)
)'''

In [94]:
may_rentaltb = pd.read_sql_query('SELECT * FROM may_table', engine)
pd.DataFrame(may_rentaltb).head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

## Insert values in the table `rentals_may` using the table rental, filtering values only for the month of May.

In [90]:
may_data = ''' INSERT INTO may_table
SELECT * 
FROM rental 
WHERE MONTH(rental_date) = 05;
'''

In [91]:
may_rentaldt = pd.read_sql_query('SELECT * FROM rental WHERE MONTH(rental_date) = 05;', engine)
may_rentaldt

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

## Create a table `rentals_june` to store the data from rental table with information for the month of June.

In [27]:
june_table = '''
CREATE TABLE june_table(
rental_id INT UNIQUE NOT NULL, 
rental_date DATETIME DEFAULT NULL,
inventory_id INT UNSIGNED DEFAULT NULL,
customer_id INT UNSIGNED DEFAULT NULL,
return_date DATETIME DEFAULT NULL,
staff_id INT UNSIGNED DEFAULT NULL,
last_update TIMESTAMP DEFAULT NULL,
CONSTRAINT PRIMARY KEY (rental_id)
)'''

In [63]:
june_rentaltb = pd.read_sql_query('SELECT * FROM june_table', engine)
june_rentaltb.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

## Insert values in the table `rentals_june` using the table rental, filtering values only for the month of June.

In [92]:
june_data = ''' INSERT INTO june_table
SELECT *
FROM rental
WHERE MONTH(rental_date) = 06;
'''

In [93]:
june_rentaldt = pd.read_sql_query('SELECT * FROM rental WHERE MONTH(rental_date) = 06;', engine)
june_rentaldt.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

## Check the number of rentals for each customer for May.

In [47]:
may_check = '''
SELECT customer_id, COUNT(rental_id) AS may_rentals 
FROM may_table
GROUP BY customer_id
ORDER BY COUNT(rental_id) desc;
'''

In [54]:
may_cust_rent = pd.read_sql_query(may_check, engine)
may_cust_rent.head()

   customer_id  may_rentals
0          197            8
1          506            7
2          109            7
3          269            6
4          239            6

## Check the number of rentals for each customer for June.

In [49]:
june_check = '''
SELECT customer_id, COUNT(rental_id) AS june_rentals 
FROM june_table
GROUP BY customer_id
ORDER BY COUNT(rental_id) desc;
'''

In [50]:
june_cust_rent = pd.read_sql_query(june_check, engine)
pd.DataFrame(june_cust_rent)

     customer_id  june_rentals
0             31            11
1            454            10
2            329             9
3            295             9
4            561             9
..           ...           ...
585          425             1
586          412             1
587          335             1
588           22             1
589          126             1

[590 rows x 2 columns]

## Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

  - Check the number of rentals for each customer for May
  - Check the number of rentals for each customer for June

    **Hint**: You can store the results from the two queries in two separate dataframes.

In [13]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
from sklearn.metrics import confusion_matrix
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.preprocessing import StandardScaler

import getpass
password = getpass.getpass()

 ········

In [14]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'

engine = create_engine(connection_string)

In [56]:
data_may = pd.read_sql_query('SELECT * FROM may_table', engine)
data_may.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [57]:
data_june = pd.read_sql_query('SELECT * FROM june_table', engine)
data_june.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

## Write a function that checks if customer borrowed more or less films in the month of June as compared to May.
 
 **Hint**: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes. Here is a link to the documentation for the [merge function](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html).

In [66]:
may_rentaldt.shape
june_rentaldt.shape

(2311, 7)

In [67]:
df_merge_rent = pd.merge(may_rentaldt, june_rentaldt, on='customer_id')
df_merge_rent

,rental_id_x,rental_date_x,inventory_id_x,customer_id,return_date_x,staff_id_x,last_update_x,rental_id_y,rental_date_y,inventory_id_y,return_date_y,staff_id_y,last_update_y
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,1630,2005-06-16 07:55:01,2413,2005-06-19 06:38:01,1,2006-02-15 21:30:53
1,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,1864,2005-06-17 01:39:47,1815,2005-06-24 19:39:47,2,2006-02-15 21:30:53
2,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2163,2005-06-17 23:46:16,2600,2005-06-22 22:48:16,2,2006-02-15 21:30:53
3,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2292,2005-06-18 07:37:48,173,2005-06-20 02:45:48,2,2006-02-15 21:30:53
4,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2535,2005-06-19 01:39:04,901,2005-06-28 01:33:04,2,2006-02-15 21:30:53
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4363,1140,2005-05-31 19:36:30,3731,10,2005-06-07 18:33:30,2,2006-02-15 21:30:53,1995,2005-06-17 11:11:14,1866,2005-06-26 16:37:14,1,2006-02-15 21:30:53
4364,1140,2005-05-31 19:36:30,3731,10,2005-06-07 18:33:30,2,2006-02-15 21:30:53,2222,2005-06-18 03:26:23,3834,2005-06-26 08:50:23,2,2006-02-15 21:30:53
4365,1140,2005-05-31 19:36:30,3731,10,2005-06-07 18:33:30,2,2006-02-15 21:30:53,2814,2005-06-19 20:01:59,1783,2005-06-26 01:28:59,2,2006-02-15 21:30:53
4366,1140,2005-05-31 19:36:30,3731,10,2005-06-07 18:33:30,2,2006-02-15 21:30:53,2865,2005-06-20 00:00:55,1569,2005-06-21 02:20:55,1,2006-02-15 21:30:53
4367,1150,2005-05-31 21:20:09,1632,136,2005-06-03 19:15:09,2,2006-02-15 21:30:53,2104,2005-06-17 19:14:30,3084,2005-06-19 16:26:30,1,2006-02-15 21:30:53

In [69]:
df_merge_cust = pd.merge(may_cust_rent, june_cust_rent, on = "customer_id")
df_merge_cust

     customer_id  may_rentals  june_rentals
0            197            8             8
1            506            7             5
2            109            7             5
3            269            6             3
4            239            6             5
..           ...          ...           ...
507          234            1             8
508          431            1             7
509          351            1             3
510           10            1             5
511          136            1             1

[512 rows x 3 columns]

In [99]:
def rental_check(x):
    if x["may_cust_rent"] > x["june_cust_rent"]:
        return 'mayis>'
    if x["may_cust_rent"] < x["june_cust_rent"]:
        return 'juneis>'
    else:
        return 'may=june'

In [100]:
df_merge_rent['rental_check'] = df_merge_rent.apply(rental_check, axis=1)
df_merge_rent
#can you help me to identify the error, and how to fix it?

KeyError: 'may_cust_rent'